/**
 * Константа NO_INDEX_PAGE определяет настройки для поисковых роботов,
 * указывая, что данная страница не должна индексироваться и ссылки
 * на неё не должны следоваться.
 */
export const NO_INDEX_PAGE = { robots: { index: false, follow: false } }

/**
 * Название сайта, отображаемое в заголовке и на страницах.
 */
export const SITE_NAME = 'TeaCoder'

/**
 * Заголовок сайта, используемый для SEO и в браузерной вкладке.
 */
export const SITE_TITLE = 'Образовательная платформа для программистов'

/**
 * Описание сайта, предоставляющее краткую информацию о его содержании
 * и целях, используется для SEO.
 */
export const SITE_DESCRIPTION =
	'TeaCoder - информационно-развлекательный портал для веб-разработчиков ⚡ Обучающие курсы, новости в сфере IT и многое другое ⚡ Сообщество программистов, где вы можете учиться, общаться и развиваться вместе!'

/**
 * Ключевые слова для SEO, связанные с содержанием сайта.
 */
export const SITE_KEYWORDS = [
	'веб-разработка',
	'курсы по программированию',
	'онлайн-курсы веб-разработки',
	'программирование для начинающих',
	'веб-технологии',
	'фронтенд разработка',
	'бэкенд разработка',
	'создание сайтов',
	'web development',
	'programming courses',
	'web development online courses',
	'programming for beginners',
	'web technologies',
	'frontend development',
	'backend development',
	'website creation'
]
